{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# This notebook is used to create a movie database in Neo4j Aura database\n",
        "## Pre-requisite : Create a Neo4j Aura instance and keep it running\n",
        "\n",
        "## Step 1 : upload movies.csv\n",
        "## Step 2 : upload Persons.csv\n",
        "## Step 3: upload Directed.csv\n",
        "## Step 4: Upload Acted_in.csv"
      ],
      "metadata": {
        "id": "gxrUAjXIC0Dz"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "!pip install neo4j -q"
      ],
      "metadata": {
        "id": "vVMUowJtL8xg"
      },
      "execution_count": 2,
      "outputs": []
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "metadata": {
        "id": "jL1TqT1Gzsf6"
      },
      "outputs": [],
      "source": [
        "#uri = \"neo4j+s://your-instance-id.databases.neo4j.io\"\n",
        "#uri=\"neo4j+s://05d774a7.databases.neo4j.io\"\n",
        "uri=\"neo4j+s://8e403408.databases.neo4j.io\""
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "uri=\"neo4j+s://8e403408.databases.neo4j.io\"  # Get from Neo4j Aura console\n",
        "username = \"neo4j\"  # usually 'neo4j'\n",
        "password = \"adswC-DiHRpM6BAnMbyHjoIIqEyrZUS2VsKcJdJ7LY4\"  # set during DB setup\n"
      ],
      "metadata": {
        "id": "RTg3fXsk0IV5"
      },
      "execution_count": 3,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Create the driver\n",
        "from neo4j import GraphDatabase\n",
        "\n",
        "driver = GraphDatabase.driver(uri, auth=(username, password))"
      ],
      "metadata": {
        "id": "_vo-1vT60X9v"
      },
      "execution_count": 21,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "def read_nodes(driver):\n",
        "    with driver.session() as session:\n",
        "        result = session.run(\"MATCH (n) RETURN n LIMIT 5\")\n",
        "        for record in result:\n",
        "            node = record[\"n\"]\n",
        "            print(dict(node))\n",
        "\n",
        "read_nodes(driver)\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "oDcEy5Bs0UlK",
        "outputId": "eb7f2008-cd25-4167-aeeb-0155dd77d0dd"
      },
      "execution_count": 10,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "{'revenue': '373554033.0', 'languages': 'English', 'plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\", 'year': '1995', 'genres': 'Adventure|Animation|Children|Comedy|Fantasy', 'movieId': '1', 'title': 'Toy Story', 'released': '1995-11-22'}\n",
            "{'revenue': '262797249.0', 'languages': 'English|French', 'plot': 'When two kids find and play a magical board game, they release a man trapped for decades in it and a host of dangers that can only be stopped by finishing the game.', 'year': '1995', 'genres': 'Adventure|Children|Fantasy', 'movieId': '2', 'title': 'Jumanji', 'released': '1995-12-15'}\n",
            "{'revenue': '', 'languages': 'English', 'plot': \"John and Max resolve to save their beloved bait shop from turning into an Italian restaurant, just as its new female owner catches Max's attention.\", 'year': '1995', 'genres': 'Comedy|Romance', 'movieId': '3', 'title': 'Grumpier Old Men', 'released': '1995-12-22'}\n",
            "{'revenue': '81452156.0', 'languages': 'English', 'plot': \"Based on Terry McMillan's novel, this film follows four very different African-American women and their relationships with the male gender.\", 'year': '1995', 'genres': 'Comedy|Romance|Drama', 'movieId': '4', 'title': 'Waiting to Exhale', 'released': '1995-12-22'}\n",
            "{'revenue': '76578911.0', 'languages': 'English', 'plot': 'In this sequel, George Banks deals not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife.', 'year': '1995', 'genres': 'Comedy', 'movieId': '5', 'title': 'Father of the Bride Part II', 'released': '1995-12-08'}\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "results = driver.session().run(\"MATCH (n) RETURN n LIMIT 5\").data()\n",
        "print(results)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "eyRmQ0MH02K7",
        "outputId": "8b38af4c-8569-4f36-9dc2-2582e3136657"
      },
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "[{'n': {'revenue': '373554033.0', 'languages': 'English', 'plot': \"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.\", 'year': '1995', 'genres': 'Adventure|Animation|Children|Comedy|Fantasy', 'movieId': '1', 'title': 'Toy Story', 'released': '1995-11-22'}}, {'n': {'revenue': '262797249.0', 'languages': 'English|French', 'plot': 'When two kids find and play a magical board game, they release a man trapped for decades in it and a host of dangers that can only be stopped by finishing the game.', 'year': '1995', 'genres': 'Adventure|Children|Fantasy', 'movieId': '2', 'title': 'Jumanji', 'released': '1995-12-15'}}, {'n': {'revenue': '', 'languages': 'English', 'plot': \"John and Max resolve to save their beloved bait shop from turning into an Italian restaurant, just as its new female owner catches Max's attention.\", 'year': '1995', 'genres': 'Comedy|Romance', 'movieId': '3', 'title': 'Grumpier Old Men', 'released': '1995-12-22'}}, {'n': {'revenue': '81452156.0', 'languages': 'English', 'plot': \"Based on Terry McMillan's novel, this film follows four very different African-American women and their relationships with the male gender.\", 'year': '1995', 'genres': 'Comedy|Romance|Drama', 'movieId': '4', 'title': 'Waiting to Exhale', 'released': '1995-12-22'}}, {'n': {'revenue': '76578911.0', 'languages': 'English', 'plot': 'In this sequel, George Banks deals not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife.', 'year': '1995', 'genres': 'Comedy', 'movieId': '5', 'title': 'Father of the Bride Part II', 'released': '1995-12-08'}}]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "#read csv and upload to Neo4j Aura\n",
        "from neo4j import GraphDatabase\n",
        "import csv\n",
        "\n",
        "def load_csv_to_neo4j(tx, row):\n",
        "  #tx.run(\"MERGE (m:Movie {movieId: $movieId, title: $title,languages: $languages,plot: $plot,released: $released,revenue: $revenue,year: $year,genres:$genres})\", movieId=row['movieId'], title=row['title'], languages=row['languages'],plot=row['plot'] ,released=row['released'] ,revenue=row['revenue'] ,year=row['year'],genres=row['genres'])\n",
        "  #tx.run(\"MERGE (p:Person {person_tmdbId:$person_tmdbId, name: $name, dateofbirth: $born, birthcity:$bornIn})\",person_tmdbId=row['person_tmdbId'], name=row['name'], born=row['born'], bornIn=row['bornIn'])\n",
        "  #print(row)\n",
        "  tx.run(\"MERGE (r:Ratings {movieId: $movieId, userId: $userId, name:$name,rating:$rating,timestamp:$timestamp})\",movieId=row['\\ufeffmovieId'], userId=row['userId'], name=row['name'],rating=row['rating'], timestamp=row['timestamp'])\n",
        "\n"
      ],
      "metadata": {
        "id": "1-7ty1jAVggG"
      },
      "execution_count": 14,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "with driver.session() as session:\n",
        "    with open(\"ratings.csv\", newline='') as csvfile: # Changed to movies.csv\n",
        "\n",
        "        reader = csv.DictReader(csvfile)\n",
        "        for row in reader:\n",
        "            session.execute_write(load_csv_to_neo4j, row)"
      ],
      "metadata": {
        "collapsed": true,
        "id": "WiKDXHtEVkQs"
      },
      "execution_count": 15,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [],
      "metadata": {
        "id": "RfqPiLGjUtz9"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# --- Function to create ACTED_IN relationship ---\n",
        "def create_acted_in(tx, person_tmdbId, movieId, role):\n",
        "    tx.run(\n",
        "        \"\"\"\n",
        "        MATCH (p:Person {person_tmdbId: $person_tmdbId})\n",
        "        MATCH (m:Movie {movieId: $movieId})\n",
        "        MERGE (p)-[r:ACTED_IN]->(m)\n",
        "        ON CREATE SET r.role = $role\n",
        "        \"\"\",\n",
        "        person_tmdbId=person_tmdbId,\n",
        "        movieId=movieId,\n",
        "        role=role\n",
        "    )"
      ],
      "metadata": {
        "id": "4YkOu0a0oq_a"
      },
      "execution_count": 17,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# --- Load CSV and create relationships ---\n",
        "with driver.session() as session:\n",
        "    with open(\"acted_in.csv\", newline='', encoding='utf-8') as csvfile:\n",
        "        reader = csv.DictReader(csvfile)\n",
        "        for row in reader:\n",
        "            #print(row)\n",
        "            session.execute_write(\n",
        "                create_acted_in,\n",
        "                row['person_tmdbId'],\n",
        "                row['\\ufeffmovieId'],\n",
        "                row.get('role', '')\n",
        "            )\n",
        "\n",
        "print(\"Relationships created successfully.\")\n",
        "driver.close()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "collapsed": true,
        "id": "LxkwNQ-agMX-",
        "outputId": "47837cb6-d79e-4070-98ff-d0b3bfdb987c"
      },
      "execution_count": 18,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Relationships created successfully.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Function to create DIRECTED relationship\n",
        "def create_directed(tx, person_tmdbId, movieId):\n",
        "    tx.run(\n",
        "        \"\"\"\n",
        "        MATCH (p:Person {person_tmdbId: $person_tmdbId})\n",
        "        MATCH (m:Movie {movieId: $movieId})\n",
        "        MERGE (p)-[:DIRECTED]->(m)\n",
        "        \"\"\",\n",
        "        person_tmdbId=person_tmdbId,\n",
        "        movieId=movieId\n",
        "    )"
      ],
      "metadata": {
        "id": "QO-UuvdG0kez"
      },
      "execution_count": 19,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# --- Load CSV and create relationships ---\n",
        "with driver.session() as session:\n",
        "    with open(\"directed.csv\", newline='', encoding='utf-8') as csvfile:\n",
        "        reader = csv.DictReader(csvfile)\n",
        "        for row in reader:\n",
        "            #print(row)\n",
        "            session.execute_write(\n",
        "                create_directed,\n",
        "                row['person_tmdbId'],\n",
        "                row['\\ufeffmovieId']\n",
        "            )\n",
        "\n",
        "print(\"Relationships created successfully.\")\n",
        "driver.close()"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "KuDy4NfNLnyA",
        "outputId": "7e68dc6a-5e3a-43a2-85db-66393f36432a"
      },
      "execution_count": 22,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Relationships created successfully.\n"
          ]
        }
      ]
    }
  ]
}